## Alberto Rodriguez Tena

![Diagrama E/R](entidad_relacion.jpg)

In [3]:
%load_ext sql

/usr/local/lib/python3.5/dist-packages/IPython/config.py:13: ShimWarning: The `IPython.config` package has been deprecated. You should import from traitlets.config instead.
  "You should import from traitlets.config instead.", ShimWarning)
/usr/local/lib/python3.5/dist-packages/IPython/utils/traitlets.py:5: UserWarning: IPython.utils.traitlets has moved to a top-level traitlets package.
  warn("IPython.utils.traitlets has moved to a top-level traitlets package.")

In [4]:
%sql sqlite:///ISI-sql.db

'Connected: None@ISI-sql.db'

In [3]:
%%sql create table ciudades(id_ciudad int not null, ca varchar(20) not null,
                             ciudad varchar(20) not null, unique(ca,ciudad), 
                             primary key(id_ciudad)
                             )

(sqlite3.OperationalError) table ciudades already exists [SQL: 'create table ciudades(id_ciudad int not null, ca varchar(20) not null,\n                             ciudad varchar(20) not null, unique(ca,ciudad), \n                             primary key(id_ciudad)\n                             )']

In [26]:
%sql insert into ciudades values (5,'ANDALUCIA','GRANADA')

1 rows affected.

[]

In [27]:
%sql SELECT * FROM CIUDADES

Done.

[(1, 'EXTREMADURA', 'MERIDA'),
 (2, 'ANDALUCIA', 'SEVILLA'),
 (3, 'MADRID', 'MADRID'),
 (4, 'ARAGON', 'ZARAGOZA'),
 (5, 'ANDALUCIA', 'GRANADA')]

In [7]:
%%sql create table campeonatos(id_campeonato int not null,
                              fecha_inicio datetime not null,
                              fecha_fin datetime not null, 
                               primary key(id_campeonato))

Done.

[]

In [35]:
%sql insert into campeonatos (id_campeonato,fecha_inicio,fecha_fin) values (3,"2011-08-31 10:00:00","2012-06-30 22:00:00")

1 rows affected.

[]

In [36]:
%sql select * from campeonatos

Done.

[(1, '2009-08-31 00:00:00', '2010-06-30 00:00:00'),
 (2, '2010-08-31 00:00:00', '2011-06-30 00:00:00'),
 (3, '2011-08-31 10:00:00', '2012-06-30 22:00:00')]

In [8]:
%%sql create table empresas (cif varchar(20) not null,
                            nombre varchar(20) not null,
                            primary key(cif))

Done.

[]

In [39]:
%sql insert into empresas (cif,nombre) values ('987654321A','TELEFONICA')

1 rows affected.

[]

In [40]:
%sql select * from empresas

Done.

[('123456789Z', 'URJC'), ('987654321A', 'TELEFONICA')]

In [9]:
%%sql create table entrenadores(nif varchar(20) not null, 
                               nombre varchar(50) not null,
                               apellidos varchar(50) not null,
                               fecha_nacimiento datetime not null,
                               primary key(nif))

Done.

[]

In [96]:
%sql insert into entrenadores (nif,nombre,apellidos,fecha_nacimiento) values ('55R','FRANCIS','SANCHEZ', "1980-07-15 10:00:00")

1 rows affected.

[]

In [97]:
%sql select * from entrenadores

Done.

[('505656A', 'PABLO', 'LASO', '1980-07-15 10:00:00'),
 ('506868X', 'ALBERTO', 'RODRIGUEZ', '1980-07-15 10:00:00'),
 ('55R', 'FRANCIS', 'SANCHEZ', '1980-07-15 10:00:00')]

In [10]:
%%sql create table jugadores (nif varchar(20) not null, 
                               nombre varchar(50) not null,
                               apellidos varchar(50) not null,
                               fecha_nacimiento datetime not null,
                               primary key(nif))

Done.

[]

In [130]:
%sql insert into jugadores (nif,nombre,apellidos,fecha_nacimiento) values ('50F','FERNANDO','CALVO', "1995-07-15 10:00:00")

1 rows affected.

[]

In [131]:
%sql select * from jugadores

Done.

[('502323J', 'LEBRON', 'JAMES', '1980-07-15 10:00:00'),
 ('508188R', 'CHACHO', 'RODRIGUEZ', '1985-07-15 10:00:00'),
 ('50P', 'PEPE', 'SANTOS', '1985-07-15 10:00:00'),
 ('50J', 'JUAN', 'DOMINGO', '1995-07-15 10:00:00'),
 ('50A', 'ANTONIO', 'GOMEZ', '1995-07-15 10:00:00'),
 ('50M', 'MIGUEL', 'ESCRIBANO', '1995-07-15 10:00:00'),
 ('50C', 'CRISTIANO', 'SANZ', '1995-07-15 10:00:00'),
 ('50E', 'ENRIQUE', 'SANZ', '1995-07-15 10:00:00'),
 ('50R', 'RAUL', 'GONZALEZ', '1995-07-15 10:00:00'),
 ('50L', 'LEONARDO', 'CALVO', '1995-07-15 10:00:00'),
 ('50F', 'FERNANDO', 'CALVO', '1995-07-15 10:00:00')]

In [42]:
%%sql create table direcciones_canchas (id_direccion int not null,
                                       calle varchar(50) not null,
                                       numero int not null,
                                       id_ciudad int not null,
                                       foreign key (id_ciudad)references ciudades(id_ciudad),
                                       primary key(id_direccion))

(sqlite3.OperationalError) table direcciones_canchas already exists [SQL: 'create table direcciones_canchas (id_direccion int not null,\n                                       calle varchar(50) not null,\n                                       numero int not null,\n                                       id_ciudad int not null,\n                                       foreign key (id_ciudad)references ciudades(id_ciudad),\n                                       primary key(id_direccion))']

In [60]:
%sql insert into direcciones_canchas (id_direccion,calle,numero,id_ciudad) values (4,'C/ LEGANITOS',75,1)

1 rows affected.

[]

In [61]:
%sql select * from direcciones_canchas

Done.

[(1, 'C/ OCA', 10, 3),
 (2, 'C/ ROMA', 45, 1),
 (3, 'C/ SEVILLA', 75, 2),
 (4, 'C/ LEGANITOS', 75, 1)]

In [15]:
%%sql create table canchas (id_cancha int not null,
                           nombre varchar(20) not null,
                           direccion int not null,
                           foreign key (direccion) references direcciones_canchas(id_direccion),
                           primary key (id_cancha))

Done.

[]

In [68]:
%sql insert into canchas (id_cancha,nombre,direccion) values (4,'ESTADIO CENTRO',4)

1 rows affected.

[]

In [69]:
%sql select * from canchas

Done.

[(1, 'POLIDEPORTIVO OCA', 1),
 (2, 'ESTADIO ROMA', 2),
 (3, 'ESTADIO SEVILLA', 3),
 (4, 'ESTADIO CENTRO', 4)]

In [23]:
%%sql create table equipos (id_equipo int not null,
                           nombre varchar(50) not null,
                           ciudad int not null,
                           foreign key (ciudad) references ciudades(id_ciudad),
                           primary key (id_equipo),
                           unique (nombre,ciudad))

Done.

[]

In [75]:
%sql insert into equipos (id_equipo,nombre,ciudad) values (4,'MADRILEÑOS',3)

1 rows affected.

[]

In [76]:
%sql select * from equipos

Done.

[(1, 'OCAREROS', 3),
 (2, 'ROMANOS', 1),
 (3, 'SEVILLISTAS', 2),
 (4, 'MADRILEÑOS', 3)]

In [28]:
%%sql create table relacion (id_relacion int not null,
                            id_equipo int not null,
                            id_cancha int not null,
                            foreign key (id_equipo) references equipos(is_equipo),
                            foreign key (id_cancha) references canchas(id_cancha),
                            unique(id_equipo,id_cancha),
                             primary key (id_relacion))

Done.

[]

In [81]:
%sql insert into relacion (id_relacion, id_equipo,id_cancha) values (5,4,4)

1 rows affected.

[]

In [82]:
%sql select * from relacion

Done.

[(1, 1, 1), (2, 2, 2), (3, 3, 3), (4, 1, 4), (5, 4, 4)]

In [29]:
%%sql create table patrocinadores(id_patrocinador int not null,
                                 cif varchar(20) not null,
                                 id_equipo int not null,
                                 foreign key (id_equipo) references equipos(is_equipo),
                                 foreign key (cif) references empresas(cif),
                                 unique (cif,id_equipo),
                                 primary key (id_patrocinador)

                                 )

Done.

[]

In [88]:
%sql insert into patrocinadores (id_patrocinador,cif,id_equipo) values (3,'987654321A',3)

1 rows affected.

[]

In [89]:
%sql select * from patrocinadores

Done.

[(1, '123456789Z', 1), (2, '123456789Z', 2), (3, '987654321A', 3)]

In [7]:
%%sql create table entrenadores_equipo(nif varchar(20) not null,
                                      id_relacion int not null,
                                      id_campeonato int not null,
                                      foreign key (id_relacion) references relacion(id_relacion),
                                      foreign key (id_campeonato) references campeonatos(id_campeonato),
                                      foreign key (nif) references entrnadores(nif),
                                      unique(nif,id_campeonato))

Done.

[]

In [99]:
%sql insert into entrenadores_equipo (nif,id_relacion,id_campeonato) values ("55R",3,2)

1 rows affected.

[]

In [100]:
%sql select * from entrenadores_equipo

Done.

[('505656A', 1, 1), ('506868X', 2, 1), ('55R', 4, 1), ('55R', 3, 2)]

In [8]:
%%sql create table partido (id_partido int not null,
                           local int not null,
                           visitante int not null,
                           cancha int not null,
                           hora_inicio datetime not null,
                           hora_fin datetime not null,
                           foreign key (local) references equipos(id_equipo),
                           foreign key (visitante) references equipos(id_equipo),
                            foreign key (cancha) references canchas(id_cancha), 
                            primary key (id_partido)
                           )

Done.

[]

In [103]:
%%sql insert into partido (id_partido,local,visitante,cancha,hora_inicio,hora_fin) values
                    (2,3,4,3,"2009-09-10 10:00:00","2009-09-10 13:00:0")

1 rows affected.

[]

In [105]:
%sql select * from partido

Done.

[(1, 1, 2, 1, '2009-09-10 10:00:00', '2009-09-10 13:00:0'),
 (2, 3, 4, 3, '2009-09-10 10:00:00', '2009-09-10 13:00:0')]

In [9]:
%%sql create table jugadores_equipos (nif varchar(20) not null, id_equipo int not null,
                             id_campeonato int not null,
                             foreign key (nif) references jugadores(nif),
                             foreign key (id_equipo) references equipos(id_equipo),
                             foreign key (id_campeonato) references campeonatos (id_campeonato),
                             unique (nif,id_campeonato))

Done.

[]

In [132]:
%sql insert into jugadores_equipos (nif,id_equipo,id_campeonato) values ("50F",1,1)

1 rows affected.

[]

In [133]:
%sql select * from jugadores_equipos

Done.

[('502323J', 1, 1),
 ('508188R', 1, 1),
 ('50P', 1, 1),
 ('50J', 1, 1),
 ('50A', 1, 1),
 ('50M', 2, 1),
 ('50C', 2, 1),
 ('50E', 2, 1),
 ('50R', 2, 1),
 ('50L', 2, 1),
 ('50F', 1, 1)]

In [127]:
%%sql create table posiciones (id_partido int not null, nif varchar(20) not null,
                              posicion varchar(20) not null, minutos int not null,
                              foreign key (nif) references jugadores(nif),
                             foreign key (id_partido) references partido(id_partido)  )

Done.

[]

In [137]:
%sql insert into posiciones (id_partido,nif,posicion,minutos) values (1,"50A","BANQUILLO",10)

1 rows affected.

[]

In [22]:
%sql update posiciones set nif='502323J' where nif='502323j'

2 rows affected.

[]

In [23]:
%sql select * from posiciones

Done.

[(1, '502323J', 'PIVOT', 5),
 (1, '502323J', 'ALERO', 5),
 (1, '50F', 'BANQUILLO', 5),
 (1, '50P', 'BASE', 5),
 (1, '50C', 'ESCOLTA', 5),
 (1, '50A', 'BANQUILLO', 10)]

In [109]:
%%sql create table titulares (id_partido int not null, id_equipo int not null,
                             jugador1 varchar(20) not null,jugador2 varchar(20) not null,
                             jugador3 varchar(20) not null,jugador4 varchar(20) not null,
                             jugador5 varchar(20) not null,
                             foreign key (jugador1) references jugadores(nif),
                             foreign key (jugador2) references jugadores(nif),
                             foreign key (jugador3) references jugadores(nif),
                             foreign key (jugador4) references jugadores(nif),
                             foreign key (jugador5) references jugadores(nif),
                             foreign key (id_partido) references partido(id_partido),
                             foreign key (id_equipo) references equipos(id_equipo),
                             unique (id_partido,id_equipo))

Done.

[]

In [141]:
%%sql insert into titulares (id_partido,id_equipo,jugador1,jugador2,jugador3,jugador4,jugador5) values
                        (1,2,"50M","50C","50E","50R","50L")

1 rows affected.

[]

In [143]:
%sql select * from titulares

Done.

[(1, 1, '502323J', '508188R', '50P', '50J', '50F'),
 (1, 2, '50M', '50C', '50E', '50R', '50L')]

In [111]:
%%sql create table caracteristicas (nif varchar(20) not null, estatura float not null,
                                   id_partido int not null,peso float not null,
                                   foreign key (nif) references jugadores(nif),
                                  foreign key (id_partido) references partido(id_partido),
                                    unique(nif,id_partido)
                             )

Done.

[]

In [145]:
%sql insert into caracteristicas (nif,estatura,id_partido,peso) values ("50C",1.90,1,85)

1 rows affected.

[]

In [147]:
%sql select * from caracteristicas

Done.

[('502323J', 2.05, 1, 95.0), ('50C', 1.9, 1, 85.0)]

In [150]:
%%sql create table cuartos (id_partido int not null, n_cuarto int not null,
                           hora_inicio datetime not null, hora_fin datetime not null,
                           puntos_local int not null,puntos_visitante int not null,
                           foreign key (id_partido) references partido(id_partido),
                            unique(id_partido,n_cuarto)
                           )

Done.

[]

In [156]:
%%sql insert into cuartos (id_partido,n_cuarto,hora_inicio,hora_fin,puntos_local,puntos_visitante) values
                    (1,4,"2009-09-10 12:10:00","2009-09-10 13:00:00",30,33)

1 rows affected.

[]

In [157]:
%sql select * from cuartos

Done.

[(1, 1, '2009-09-10 10:00:00', '2009-09-10 10:20:00', 10, 9),
 (1, 2, '2009-09-10 10:25:00', '2009-09-10 10:45:00', 20, 18),
 (1, 3, '2009-09-10 11:10:00', '2009-09-10 11:45:00', 30, 33),
 (1, 4, '2009-09-10 12:10:00', '2009-09-10 13:00:00', 30, 33)]

In [5]:
%%sql create table jugadas (id_jugada int not null, 
                            i_inicio datetime not null,
                            i_fin datetime not null, 
                            jugador varchar(20) not null,
                            coordenada_x float not null, 
                            coordenada_y float not null,
                            id_partido int not null,
                            primary key (id_jugada), 
                            foreign key (jugador) references jugadores (nif),
                            foreign key (id_partido) references partido (id_partido)
                           )

Done.

[]

In [93]:
%%sql insert into jugadas (id_jugada,i_inicio,i_fin,jugador,coordenada_x,coordenada_y,id_partido)
            values (3,"2009-09-10 10:21:01","2009-09-10 10:32:20","50M",0,5,1)

1 rows affected.

[]

In [78]:
%sql select * from jugadas

Done.

[(1, '2009-09-10 10:00:01', '2009-09-10 10:00:20', '50P', 0.0, 5.0, 1),
 (2, '2009-09-10 10:01:01', '2009-09-10 10:02:20', '50L', 0.0, 5.0, 1)]

In [16]:
%%sql create table canasta (id_canasta int not null, 
                            puntuación int not null, 
                            fuera varchar(2) not null,
                            otro varchar(2) not null,
                            id_jugada int not null, 
                            primary key (id_canasta), 
                            foreign key (id_jugada) references jugadas (id_jugada))

Done.

[]

In [80]:
%%sql insert into canasta (id_canasta,puntuación,fuera,otro,id_jugada)
        values (2,2,"NO","NO",2)

1 rows affected.

[]

In [81]:
%sql select * from canasta

Done.

[(1, 2, 'NO', 'NO', 1), (2, 2, 'NO', 'NO', 2)]

In [21]:
%%sql create table rebote (id_rebote int not null, 
                           id_jugada int not null, 
                           primary key(id_rebote),
                           foreign key (id_jugada) references jugadas (id_jugada))

Done.

[]

In [11]:
%%sql create table pase (id_pase int not null, 
                         fuera varchar(2) not null,
                         compañero varchar(2) not null,
                         contrario varchar(2) not null,
                         id_jugada int not null, 
                         primary key (id_pase),
                         foreign key (id_jugada) references jugadas (id_jugada))

Done.

[]

In [12]:
%%sql create table robo(id_robo int not null, 
                        quien varchar(20) not null, 
                        a_quien varchar(20) not null,
                        id_jugada int not null, 
                        primary key (id_robo),
                        foreign key (id_jugada) references jugadas (id_jugada)
                        foreign key (quien) references jugadores (nif),
                        foreign key (a_quien) references jugadores (nif))

Done.

[]

In [14]:
%%sql create table interceptación (id_inter int not null, 
                                   pase varchar(2) not null, 
                                   tiro varchar(2) not null,
                                   id_jugada int not null,
                                   primary key (id_inter),
                                   foreign key (id_jugada) references jugadas (id_jugada))

Done.

[]

In [5]:
%%sql create table defensas (id_defensa int not null,
                            i_inicio datetime not null,
                            i_fin datetime not null, 
                            jugador_defendido varchar(20) not null,
                            jugador_defendiendole varchar(20) not null,
                            otro_defendiendole varchar(20),
                            primary key(id_defensa),
                            foreign key (jugador_defendido) references jugadores(nif),
                            foreign key (jugador_defendiendole) references jugadores(nif),
                            foreign key (otro_defendiendole) references jugadores(nif))

Done.

[]

In [4]:
%%sql create table records (jugador varchar(20) not null,
                            id_partido int not null,
                            id_jugada int not null, 
                            foreign key (jugador) references jugadores (nif),
                            foreign key (id_partido) references partido (id_partido),
                            foreign key (id_jugada) references jugadas (id_jugada))

Done.

[]

In [27]:
%sql insert into records(jugador,id_partido,id_jugada) values ('50J',1,1)

1 rows affected.

[]

In [28]:
%sql select * from records

Done.

[('50J', 1, 1)]

1.-

In [9]:
%%sql select j.nombre, j.apellidos from jugadores j, partido p, caracteristicas c
    where c.id_partido=p.id_partido and p.id_partido=1 and c.peso>90 and c.nif=j.nif

Done.

[('LEBRON', 'JAMES')]

2.-

In [25]:
%%sql select j.nombre,j.apellidos from jugadores j, partido p, posiciones po 
where po.id_partido=p.id_partido and po.posicion ="PIVOT" and p.id_partido=1 and po.nif=j.nif

Done.

[('LEBRON', 'JAMES')]

3.-

In [31]:
%sql select j.nombre, j.apellidos from jugadores j, partido p,records r where r.jugador = j.nif and r.id_partido=p.id_partido

Done.

[('JUAN', 'DOMINGO')]

4.-

In [40]:
%%sql select can.nombre as cancha,j.nombre as nombre,j.apellidos from jugadores j,partido p, titulares t, campeonatos c,canchas can
where t.id_partido = p.id_partido and (t.jugador1='50P' or t.jugador2='50P' or t.jugador3='50P' or t.jugador4='50P'
                                       or t.jugador2='50P') and p.hora_inicio<c.fecha_fin and c.id_campeonato=1
and p.cancha = can.id_cancha and j.nif='50P'

Done.

[('POLIDEPORTIVO OCA', 'PEPE', 'SANTOS')]

5.-

In [99]:
%%sql select p.id_partido, c.puntos_local + c.puntos_visitante as totales from partido p, cuartos c 
where p.id_partido = c.id_partido
group by p.id_partido
order by totales desc limit (3)

Done.

[(1, 63)]

6.-

In [45]:
%%sql select ciu.ciudad,j.nombre as nombre,j.apellidos from jugadores j,partido p, titulares t,
canchas can,ciudades ciu,direcciones_canchas dire
where t.id_partido = p.id_partido and (t.jugador1='50P' or t.jugador2='50P' or t.jugador3='50P' or t.jugador4='50P'
or t.jugador2='50P') and j.nif='50P' and p.cancha = can.id_cancha and can.direccion = dire.id_direccion and 
dire.id_ciudad = ciu.id_ciudad

Done.

[('MADRID', 'PEPE', 'SANTOS')]

7.-

In [67]:
%%sql select 'DE Equipo Local: '||e.nombre,c.n_cuarto,c.puntos_local as puntos,p.id_partido from equipos e,partido p,cuartos c 
where c.id_partido = p.id_partido and p.local=e.id_equipo
union
select 'DE Equipo visitante: '||e.nombre,c.n_cuarto,c.puntos_visitante as puntos,p.id_partido from equipos e,partido p,cuartos c 
where c.id_partido = p.id_partido and p.visitante=e.id_equipo
order by puntos desc limit(1)

Done.

[('DE Equipo visitante: ROMANOS', 3, 33, 1)]

8.-

In [86]:
%%sql select e.nombre,sum(c.puntuación) from canasta c, equipos e, partido p,jugadas j, jugadores_equipos ju
where c.id_jugada=j.id_jugada and j.id_partido=p.id_partido and p.id_partido = 1 and j.i_fin <= "2009-09-10 10:10:30"
and j.jugador=ju.nif and ju.id_equipo=e.id_equipo
group by e.nombre

Done.

[('OCAREROS', 2), ('ROMANOS', 2)]

9.-

In [94]:
%%sql select ju.nombre as nombre, sum(j.i_fin-j.i_inicio) as tiempo from jugadores ju, jugadas j
where j.jugador ="50M" and j.jugador = ju.nif
group by nombre

Done.

[('MIGUEL', 0)]

11.-

In [102]:
%%sql select e.nombre,sum(c.puntuación) from canasta c, equipos e, partido p,jugadas j, jugadores_equipos ju
where c.id_jugada=j.id_jugada and j.id_partido=p.id_partido and p.id_partido = 1 and j.jugador=ju.nif and ju.id_equipo=e.id_equipo
and e.nombre='OCAREROS'
group by e.nombre

Done.

[('OCAREROS', 2)]

12.-

In [109]:
%%sql select e.nombre, c.n_cuarto,c.puntos_local puntos, p.id_partido partido from equipos e, cuartos c, partido p
where c.id_partido=p.id_partido and p.id_partido=1 and p.local = e.id_equipo and c.n_cuarto=3

Done.

[('OCAREROS', 3, 30, 1)]

13.-

In [114]:
%%sql select count(p.id_partido) numero from partido p,canchas can 
where p.cancha=can.id_cancha and can.nombre= 'POLIDEPORTIVO OCA'

Done.

[(1,)]

15.-

In [128]:
%%sql select e.nombre, eq.nombre equipos from entrenadores e, entrenadores_equipo ee, equipos eq, relacion r
where ee.nif='505656A' and ee.id_relacion=r.id_relacion and r.id_equipo = eq.id_equipo and ee.nif=e.nif

Done.

[('PABLO', 'OCAREROS')]